** Dangling References

   In languages with pointers, its easy to erroneously create a dangling pointer (a pointer that references a location in memory that may have been given to someone else), by freeing some memory while preserving a pointer to that memory.
   In Rust, if you have a reference to some data, the compiler will ensure that the data will not go out of scope before the reference to the data does.

#+name: dangling-reference
#+BEGIN_SRC rust
fn dangle() -> &String {
    let s = String::from("hello");
    &s // return a reference to s
} // here s goes out of scope, so there is nothing to point to!

fn main() {
    let reference_to_nothing = dangle();
}
#+END_SRC

#+name:
#+BEGIN_SRC rust
error[E0106]: missing lifetime specifier
 --> src/main.rs:2:16
  |
2 | fn dangle() -> &String {
  |                ^ expected named lifetime parameter
  |
  = help: this function's return type contains a borrowed value, but there is no value for it to be borrowed from
help: consider using the `'static` lifetime
  |
2 | fn dangle() -> &'static String {
  |                ^^^^^^^^

error: aborting due to previous error

For more information about this error, try `rustc --explain E0106`.
error: could not compile `cargoVw2IPr`.

To learn more, run the command again with --verbose.
#+END_SRC

The solution is to return the String directly

#+name:
#+BEGIN_SRC rust
fn dangle() -> String {
    let s = String::from("hello");
    s
}

fn main() {
    let reference_to_nothing = dangle();
    println!("Dang, dangle! {}", reference_to_nothing);
}
#+END_SRC

#+RESULTS: 
: Dang, dangle! hello

